# GetSchedulableFields Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetSchedulableFields Method
ScheduleDefinition Class See Also
---
Gets a list of all non-calculated/non-combined fields that are eligible to be included in this schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<SchedulableField> GetSchedulableFields()
```

Visual Basic
---
```text
Public Function GetSchedulableFields As IList(Of SchedulableField)
```

Visual C++
---
```text
public:
IList<SchedulableField^>^ GetSchedulableFields()
```

# ### Return Value
A list of SchedulableField objects representing the non-calculated/non-combined fields that may be included in the schedule.
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace